listener/Requests/GetEntireNewsByID.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
        <Action soapenv:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">
            http://ifx.ru/IFX3WebService/IIFXService/GetRealtimeNewsByProduct
        </Action>
    </soapenv:Header>
    <soapenv:Body>
        <genmreq xmlns="http://ifx.ru/IFX3WebService">
        </genmreq>
    </soapenv:Body>
</soapenv:Envelope>